Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/aes.h
/**
 * \brief Component description for AES
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_AES_COMPONENT_H_
#define _SAM9X_AES_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR AES                                          */
/* ************************************************************************** */

/* -------- AES_CR : (AES Offset: 0x00) ( /W 32) Control Register -------- */
#define AES_CR_START_Pos                      _U_(0)                                               /**< (AES_CR) Start Processing Position */
#define AES_CR_START_Msk                      (_U_(0x1) << AES_CR_START_Pos)                       /**< (AES_CR) Start Processing Mask */
#define AES_CR_START(value)                   (AES_CR_START_Msk & ((value) << AES_CR_START_Pos))  
#define AES_CR_SWRST_Pos                      _U_(8)                                               /**< (AES_CR) Software Reset Position */
#define AES_CR_SWRST_Msk                      (_U_(0x1) << AES_CR_SWRST_Pos)                       /**< (AES_CR) Software Reset Mask */
#define AES_CR_SWRST(value)                   (AES_CR_SWRST_Msk & ((value) << AES_CR_SWRST_Pos))  
#define AES_CR_LOADSEED_Pos                   _U_(16)                                              /**< (AES_CR) Random Number Generator Seed Loading Position */
#define AES_CR_LOADSEED_Msk                   (_U_(0x1) << AES_CR_LOADSEED_Pos)                    /**< (AES_CR) Random Number Generator Seed Loading Mask */
#define AES_CR_LOADSEED(value)                (AES_CR_LOADSEED_Msk & ((value) << AES_CR_LOADSEED_Pos))
#define AES_CR_UNLOCK_Pos                     _U_(24)                                              /**< (AES_CR) Unlock Processing Position */
#define AES_CR_UNLOCK_Msk                     (_U_(0x1) << AES_CR_UNLOCK_Pos)                      /**< (AES_CR) Unlock Processing Mask */
#define AES_CR_UNLOCK(value)                  (AES_CR_UNLOCK_Msk & ((value) << AES_CR_UNLOCK_Pos))
#define AES_CR_Msk                            _U_(0x01010101)                                      /**< (AES_CR) Register Mask  */


/* -------- AES_MR : (AES Offset: 0x04) (R/W 32) Mode Register -------- */
#define AES_MR_CIPHER_Pos                     _U_(0)                                               /**< (AES_MR) Processing Mode Position */
#define AES_MR_CIPHER_Msk                     (_U_(0x1) << AES_MR_CIPHER_Pos)                      /**< (AES_MR) Processing Mode Mask */
#define AES_MR_CIPHER(value)                  (AES_MR_CIPHER_Msk & ((value) << AES_MR_CIPHER_Pos))
#define AES_MR_GTAGEN_Pos                     _U_(1)                                               /**< (AES_MR) GCM Automatic Tag Generation Enable Position */
#define AES_MR_GTAGEN_Msk                     (_U_(0x1) << AES_MR_GTAGEN_Pos)                      /**< (AES_MR) GCM Automatic Tag Generation Enable Mask */
#define AES_MR_GTAGEN(value)                  (AES_MR_GTAGEN_Msk & ((value) << AES_MR_GTAGEN_Pos))
#define AES_MR_DUALBUFF_Pos                   _U_(3)                                               /**< (AES_MR) Dual Input Buffer Position */
#define AES_MR_DUALBUFF_Msk                   (_U_(0x1) << AES_MR_DUALBUFF_Pos)                    /**< (AES_MR) Dual Input Buffer Mask */
#define AES_MR_DUALBUFF(value)                (AES_MR_DUALBUFF_Msk & ((value) << AES_MR_DUALBUFF_Pos))
#define   AES_MR_DUALBUFF_INACTIVE_Val        _U_(0x0)                                             /**< (AES_MR) AES_IDATARx cannot be written during processing of previous block.  */
#define   AES_MR_DUALBUFF_ACTIVE_Val          _U_(0x1)                                             /**< (AES_MR) AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files.  */
#define AES_MR_DUALBUFF_INACTIVE              (AES_MR_DUALBUFF_INACTIVE_Val << AES_MR_DUALBUFF_Pos) /**< (AES_MR) AES_IDATARx cannot be written during processing of previous block. Position  */
#define AES_MR_DUALBUFF_ACTIVE                (AES_MR_DUALBUFF_ACTIVE_Val << AES_MR_DUALBUFF_Pos)  /**< (AES_MR) AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files. Position  */
#define AES_MR_PROCDLY_Pos                    _U_(4)                                               /**< (AES_MR) Processing Delay Position */
#define AES_MR_PROCDLY_Msk                    (_U_(0xF) << AES_MR_PROCDLY_Pos)                     /**< (AES_MR) Processing Delay Mask */
#define AES_MR_PROCDLY(value)                 (AES_MR_PROCDLY_Msk & ((value) << AES_MR_PROCDLY_Pos))
#define AES_MR_SMOD_Pos                       _U_(8)                                               /**< (AES_MR) Start Mode Position */
#define AES_MR_SMOD_Msk                       (_U_(0x3) << AES_MR_SMOD_Pos)                        /**< (AES_MR) Start Mode Mask */
#define AES_MR_SMOD(value)                    (AES_MR_SMOD_Msk & ((value) << AES_MR_SMOD_Pos))    
#define   AES_MR_SMOD_MANUAL_START_Val        _U_(0x0)                                             /**< (AES_MR) Manual Mode  */
#define   AES_MR_SMOD_AUTO_START_Val          _U_(0x1)                                             /**< (AES_MR) Auto Mode  */
#define   AES_MR_SMOD_IDATAR0_START_Val       _U_(0x2)                                             /**< (AES_MR) AES_IDATAR0 access only Auto Mode (DMA)  */
#define AES_MR_SMOD_MANUAL_START              (AES_MR_SMOD_MANUAL_START_Val << AES_MR_SMOD_Pos)    /**< (AES_MR) Manual Mode Position  */
#define AES_MR_SMOD_AUTO_START                (AES_MR_SMOD_AUTO_START_Val << AES_MR_SMOD_Pos)      /**< (AES_MR) Auto Mode Position  */
#define AES_MR_SMOD_IDATAR0_START             (AES_MR_SMOD_IDATAR0_START_Val << AES_MR_SMOD_Pos)   /**< (AES_MR) AES_IDATAR0 access only Auto Mode (DMA) Position  */
#define AES_MR_KEYSIZE_Pos                    _U_(10)                                              /**< (AES_MR) Key Size Position */
#define AES_MR_KEYSIZE_Msk                    (_U_(0x3) << AES_MR_KEYSIZE_Pos)                     /**< (AES_MR) Key Size Mask */
#define AES_MR_KEYSIZE(value)                 (AES_MR_KEYSIZE_Msk & ((value) << AES_MR_KEYSIZE_Pos))
#define   AES_MR_KEYSIZE_AES128_Val           _U_(0x0)                                             /**< (AES_MR) AES Key Size is 128 bits  */
#define   AES_MR_KEYSIZE_AES192_Val           _U_(0x1)                                             /**< (AES_MR) AES Key Size is 192 bits  */
#define   AES_MR_KEYSIZE_AES256_Val           _U_(0x2)                                             /**< (AES_MR) AES Key Size is 256 bits  */
#define AES_MR_KEYSIZE_AES128                 (AES_MR_KEYSIZE_AES128_Val << AES_MR_KEYSIZE_Pos)    /**< (AES_MR) AES Key Size is 128 bits Position  */
#define AES_MR_KEYSIZE_AES192                 (AES_MR_KEYSIZE_AES192_Val << AES_MR_KEYSIZE_Pos)    /**< (AES_MR) AES Key Size is 192 bits Position  */
#define AES_MR_KEYSIZE_AES256                 (AES_MR_KEYSIZE_AES256_Val << AES_MR_KEYSIZE_Pos)    /**< (AES_MR) AES Key Size is 256 bits Position  */
#define AES_MR_OPMOD_Pos                      _U_(12)                                              /**< (AES_MR) Operating Mode Position */
#define AES_MR_OPMOD_Msk                      (_U_(0x7) << AES_MR_OPMOD_Pos)                       /**< (AES_MR) Operating Mode Mask */
#define AES_MR_OPMOD(value)                   (AES_MR_OPMOD_Msk & ((value) << AES_MR_OPMOD_Pos))  
#define   AES_MR_OPMOD_ECB_Val                _U_(0x0)                                             /**< (AES_MR) ECB: Electronic Codebook mode  */
#define   AES_MR_OPMOD_CBC_Val                _U_(0x1)                                             /**< (AES_MR) CBC: Cipher Block Chaining mode  */
#define   AES_MR_OPMOD_OFB_Val                _U_(0x2)                                             /**< (AES_MR) OFB: Output Feedback mode  */
#define   AES_MR_OPMOD_CFB_Val                _U_(0x3)                                             /**< (AES_MR) CFB: Cipher Feedback mode  */
#define   AES_MR_OPMOD_CTR_Val                _U_(0x4)                                             /**< (AES_MR) CTR: Counter mode (16-bit internal counter)  */
#define   AES_MR_OPMOD_GCM_Val                _U_(0x5)                                             /**< (AES_MR) GCM: Galois/Counter mode  */
#define   AES_MR_OPMOD_XTS_Val                _U_(0x6)                                             /**< (AES_MR) XTS: XEX-based tweaked-codebook mode  */
#define AES_MR_OPMOD_ECB                      (AES_MR_OPMOD_ECB_Val << AES_MR_OPMOD_Pos)           /**< (AES_MR) ECB: Electronic Codebook mode Position  */
#define AES_MR_OPMOD_CBC                      (AES_MR_OPMOD_CBC_Val << AES_MR_OPMOD_Pos)           /**< (AES_MR) CBC: Cipher Block Chaining mode Position  */
#define AES_MR_OPMOD_OFB                      (AES_MR_OPMOD_OFB_Val << AES_MR_OPMOD_Pos)           /**< (AES_MR) OFB: Output Feedback mode Position  */
#define AES_MR_OPMOD_CFB                      (AES_MR_OPMOD_CFB_Val << AES_MR_OPMOD_Pos)           /**< (AES_MR) CFB: Cipher Feedback mode Position  */
#define AES_MR_OPMOD_CTR                      (AES_MR_OPMOD_CTR_Val << AES_MR_OPMOD_Pos)           /**< (AES_MR) CTR: Counter mode (16-bit internal counter) Position  */
#define AES_MR_OPMOD_GCM                      (AES_MR_OPMOD_GCM_Val << AES_MR_OPMOD_Pos)           /**< (AES_MR) GCM: Galois/Counter mode Position  */
#define AES_MR_OPMOD_XTS                      (AES_MR_OPMOD_XTS_Val << AES_MR_OPMOD_Pos)           /**< (AES_MR) XTS: XEX-based tweaked-codebook mode Position  */
#define AES_MR_LOD_Pos                        _U_(15)                                              /**< (AES_MR) Last Output Data Mode Position */
#define AES_MR_LOD_Msk                        (_U_(0x1) << AES_MR_LOD_Pos)                         /**< (AES_MR) Last Output Data Mode Mask */
#define AES_MR_LOD(value)                     (AES_MR_LOD_Msk & ((value) << AES_MR_LOD_Pos))      
#define AES_MR_CFBS_Pos                       _U_(16)                                              /**< (AES_MR) Cipher Feedback Data Size Position */
#define AES_MR_CFBS_Msk                       (_U_(0x7) << AES_MR_CFBS_Pos)                        /**< (AES_MR) Cipher Feedback Data Size Mask */
#define AES_MR_CFBS(value)                    (AES_MR_CFBS_Msk & ((value) << AES_MR_CFBS_Pos))    
#define   AES_MR_CFBS_SIZE_128BIT_Val         _U_(0x0)                                             /**< (AES_MR) 128-bit  */
#define   AES_MR_CFBS_SIZE_64BIT_Val          _U_(0x1)                                             /**< (AES_MR) 64-bit  */
#define   AES_MR_CFBS_SIZE_32BIT_Val          _U_(0x2)                                             /**< (AES_MR) 32-bit  */
#define   AES_MR_CFBS_SIZE_16BIT_Val          _U_(0x3)                                             /**< (AES_MR) 16-bit  */
#define   AES_MR_CFBS_SIZE_8BIT_Val           _U_(0x4)                                             /**< (AES_MR) 8-bit  */
#define AES_MR_CFBS_SIZE_128BIT               (AES_MR_CFBS_SIZE_128BIT_Val << AES_MR_CFBS_Pos)     /**< (AES_MR) 128-bit Position  */
#define AES_MR_CFBS_SIZE_64BIT                (AES_MR_CFBS_SIZE_64BIT_Val << AES_MR_CFBS_Pos)      /**< (AES_MR) 64-bit Position  */
#define AES_MR_CFBS_SIZE_32BIT                (AES_MR_CFBS_SIZE_32BIT_Val << AES_MR_CFBS_Pos)      /**< (AES_MR) 32-bit Position  */
#define AES_MR_CFBS_SIZE_16BIT                (AES_MR_CFBS_SIZE_16BIT_Val << AES_MR_CFBS_Pos)      /**< (AES_MR) 16-bit Position  */
#define AES_MR_CFBS_SIZE_8BIT                 (AES_MR_CFBS_SIZE_8BIT_Val << AES_MR_CFBS_Pos)       /**< (AES_MR) 8-bit Position  */
#define AES_MR_CKEY_Pos                       _U_(20)                                              /**< (AES_MR) Countermeasure Key Position */
#define AES_MR_CKEY_Msk                       (_U_(0xF) << AES_MR_CKEY_Pos)                        /**< (AES_MR) Countermeasure Key Mask */
#define AES_MR_CKEY(value)                    (AES_MR_CKEY_Msk & ((value) << AES_MR_CKEY_Pos))    
#define   AES_MR_CKEY_PASSWD_Val              _U_(0xE)                                             /**< (AES_MR) This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0.  */
#define AES_MR_CKEY_PASSWD                    (AES_MR_CKEY_PASSWD_Val << AES_MR_CKEY_Pos)          /**< (AES_MR) This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0. Position  */
#define AES_MR_CMTYP1_Pos                     _U_(24)                                              /**< (AES_MR) Countermeasure Type 1 Position */
#define AES_MR_CMTYP1_Msk                     (_U_(0x1) << AES_MR_CMTYP1_Pos)                      /**< (AES_MR) Countermeasure Type 1 Mask */
#define AES_MR_CMTYP1(value)                  (AES_MR_CMTYP1_Msk & ((value) << AES_MR_CMTYP1_Pos))
#define   AES_MR_CMTYP1_NOPROT_EXTKEY_Val     _U_(0x0)                                             /**< (AES_MR) Countermeasure type 1 is disabled.  */
#define   AES_MR_CMTYP1_PROT_EXTKEY_Val       _U_(0x1)                                             /**< (AES_MR) Countermeasure type 1 is enabled.  */
#define AES_MR_CMTYP1_NOPROT_EXTKEY           (AES_MR_CMTYP1_NOPROT_EXTKEY_Val << AES_MR_CMTYP1_Pos) /**< (AES_MR) Countermeasure type 1 is disabled. Position  */
#define AES_MR_CMTYP1_PROT_EXTKEY             (AES_MR_CMTYP1_PROT_EXTKEY_Val << AES_MR_CMTYP1_Pos) /**< (AES_MR) Countermeasure type 1 is enabled. Position  */
#define AES_MR_CMTYP2_Pos                     _U_(25)                                              /**< (AES_MR) Countermeasure Type 2 Position */
#define AES_MR_CMTYP2_Msk                     (_U_(0x1) << AES_MR_CMTYP2_Pos)                      /**< (AES_MR) Countermeasure Type 2 Mask */
#define AES_MR_CMTYP2(value)                  (AES_MR_CMTYP2_Msk & ((value) << AES_MR_CMTYP2_Pos))
#define   AES_MR_CMTYP2_NO_PAUSE_Val          _U_(0x0)                                             /**< (AES_MR) Countermeasure type 2 is disabled.  */
#define   AES_MR_CMTYP2_PAUSE_Val             _U_(0x1)                                             /**< (AES_MR) Countermeasure type 2 is enabled.  */
#define AES_MR_CMTYP2_NO_PAUSE                (AES_MR_CMTYP2_NO_PAUSE_Val << AES_MR_CMTYP2_Pos)    /**< (AES_MR) Countermeasure type 2 is disabled. Position  */
#define AES_MR_CMTYP2_PAUSE                   (AES_MR_CMTYP2_PAUSE_Val << AES_MR_CMTYP2_Pos)       /**< (AES_MR) Countermeasure type 2 is enabled. Position  */
#define AES_MR_CMTYP3_Pos                     _U_(26)                                              /**< (AES_MR) Countermeasure Type 3 Position */
#define AES_MR_CMTYP3_Msk                     (_U_(0x1) << AES_MR_CMTYP3_Pos)                      /**< (AES_MR) Countermeasure Type 3 Mask */
#define AES_MR_CMTYP3(value)                  (AES_MR_CMTYP3_Msk & ((value) << AES_MR_CMTYP3_Pos))
#define   AES_MR_CMTYP3_NO_DUMMY_Val          _U_(0x0)                                             /**< (AES_MR) Countermeasure type 3 is disabled.  */
#define   AES_MR_CMTYP3_DUMMY_Val             _U_(0x1)                                             /**< (AES_MR) Countermeasure type 3 is enabled.  */
#define AES_MR_CMTYP3_NO_DUMMY                (AES_MR_CMTYP3_NO_DUMMY_Val << AES_MR_CMTYP3_Pos)    /**< (AES_MR) Countermeasure type 3 is disabled. Position  */
#define AES_MR_CMTYP3_DUMMY                   (AES_MR_CMTYP3_DUMMY_Val << AES_MR_CMTYP3_Pos)       /**< (AES_MR) Countermeasure type 3 is enabled. Position  */
#define AES_MR_CMTYP4_Pos                     _U_(27)                                              /**< (AES_MR) Countermeasure Type 4 Position */
#define AES_MR_CMTYP4_Msk                     (_U_(0x1) << AES_MR_CMTYP4_Pos)                      /**< (AES_MR) Countermeasure Type 4 Mask */
#define AES_MR_CMTYP4(value)                  (AES_MR_CMTYP4_Msk & ((value) << AES_MR_CMTYP4_Pos))
#define   AES_MR_CMTYP4_NO_RESTART_Val        _U_(0x0)                                             /**< (AES_MR) Countermeasure type 4 is disabled.  */
#define   AES_MR_CMTYP4_RESTART_Val           _U_(0x1)                                             /**< (AES_MR) Countermeasure type 4 is enabled.  */
#define AES_MR_CMTYP4_NO_RESTART              (AES_MR_CMTYP4_NO_RESTART_Val << AES_MR_CMTYP4_Pos)  /**< (AES_MR) Countermeasure type 4 is disabled. Position  */
#define AES_MR_CMTYP4_RESTART                 (AES_MR_CMTYP4_RESTART_Val << AES_MR_CMTYP4_Pos)     /**< (AES_MR) Countermeasure type 4 is enabled. Position  */
#define AES_MR_CMTYP5_Pos                     _U_(28)                                              /**< (AES_MR) Countermeasure Type 5 Position */
#define AES_MR_CMTYP5_Msk                     (_U_(0x1) << AES_MR_CMTYP5_Pos)                      /**< (AES_MR) Countermeasure Type 5 Mask */
#define AES_MR_CMTYP5(value)                  (AES_MR_CMTYP5_Msk & ((value) << AES_MR_CMTYP5_Pos))
#define   AES_MR_CMTYP5_NO_ADDACCESS_Val      _U_(0x0)                                             /**< (AES_MR) Countermeasure type 5 is disabled.  */
#define   AES_MR_CMTYP5_ADDACCESS_Val         _U_(0x1)                                             /**< (AES_MR) Countermeasure type 5 is enabled.  */
#define AES_MR_CMTYP5_NO_ADDACCESS            (AES_MR_CMTYP5_NO_ADDACCESS_Val << AES_MR_CMTYP5_Pos) /**< (AES_MR) Countermeasure type 5 is disabled. Position  */
#define AES_MR_CMTYP5_ADDACCESS               (AES_MR_CMTYP5_ADDACCESS_Val << AES_MR_CMTYP5_Pos)   /**< (AES_MR) Countermeasure type 5 is enabled. Position  */
#define AES_MR_CMTYP6_Pos                     _U_(29)                                              /**< (AES_MR) Countermeasure Type 6 Position */
#define AES_MR_CMTYP6_Msk                     (_U_(0x1) << AES_MR_CMTYP6_Pos)                      /**< (AES_MR) Countermeasure Type 6 Mask */
#define AES_MR_CMTYP6(value)                  (AES_MR_CMTYP6_Msk & ((value) << AES_MR_CMTYP6_Pos))
#define   AES_MR_CMTYP6_NO_IDLECURRENT_Val    _U_(0x0)                                             /**< (AES_MR) Countermeasure type 6 is disabled.  */
#define   AES_MR_CMTYP6_IDLECURRENT_Val       _U_(0x1)                                             /**< (AES_MR) Countermeasure type 6 is enabled.  */
#define AES_MR_CMTYP6_NO_IDLECURRENT          (AES_MR_CMTYP6_NO_IDLECURRENT_Val << AES_MR_CMTYP6_Pos) /**< (AES_MR) Countermeasure type 6 is disabled. Position  */
#define AES_MR_CMTYP6_IDLECURRENT             (AES_MR_CMTYP6_IDLECURRENT_Val << AES_MR_CMTYP6_Pos) /**< (AES_MR) Countermeasure type 6 is enabled. Position  */
#define AES_MR_CMTYP7_Pos                     _U_(30)                                              /**< (AES_MR) Countermeasure Type 7 Position */
#define AES_MR_CMTYP7_Msk                     (_U_(0x1) << AES_MR_CMTYP7_Pos)                      /**< (AES_MR) Countermeasure Type 7 Mask */
#define AES_MR_CMTYP7(value)                  (AES_MR_CMTYP7_Msk & ((value) << AES_MR_CMTYP7_Pos))
#define   AES_MR_CMTYP7_NO_STARTDELAY_Val     _U_(0x0)                                             /**< (AES_MR) Countermeasure type 7 is disabled.  */
#define   AES_MR_CMTYP7_STARTDELAY_Val        _U_(0x1)                                             /**< (AES_MR) Countermeasure type 7 is enabled.  */
#define AES_MR_CMTYP7_NO_STARTDELAY           (AES_MR_CMTYP7_NO_STARTDELAY_Val << AES_MR_CMTYP7_Pos) /**< (AES_MR) Countermeasure type 7 is disabled. Position  */
#define AES_MR_CMTYP7_STARTDELAY              (AES_MR_CMTYP7_STARTDELAY_Val << AES_MR_CMTYP7_Pos)  /**< (AES_MR) Countermeasure type 7 is enabled. Position  */
#define AES_MR_TAMPCLR_Pos                    _U_(31)                                              /**< (AES_MR) Tamper Clear Enable Position */
#define AES_MR_TAMPCLR_Msk                    (_U_(0x1) << AES_MR_TAMPCLR_Pos)                     /**< (AES_MR) Tamper Clear Enable Mask */
#define AES_MR_TAMPCLR(value)                 (AES_MR_TAMPCLR_Msk & ((value) << AES_MR_TAMPCLR_Pos))
#define AES_MR_Msk                            _U_(0xFFF7FFFB)                                      /**< (AES_MR) Register Mask  */

#define AES_MR_CMTYP_Pos                      _U_(24)                                              /**< (AES_MR Position) Countermeasure Type x */
#define AES_MR_CMTYP_Msk                      (_U_(0x7F) << AES_MR_CMTYP_Pos)                      /**< (AES_MR Mask) CMTYP */
#define AES_MR_CMTYP(value)                   (AES_MR_CMTYP_Msk & ((value) << AES_MR_CMTYP_Pos))   

