Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/aes.h
/* -------- AES_TWR : (AES Offset: 0xC0) (R/W 32) Tweak Word Register -------- */
#define AES_TWR_TWEAK_Pos                     _U_(0)                                               /**< (AES_TWR) Tweak Word x Position */
#define AES_TWR_TWEAK_Msk                     (_U_(0xFFFFFFFF) << AES_TWR_TWEAK_Pos)               /**< (AES_TWR) Tweak Word x Mask */
#define AES_TWR_TWEAK(value)                  (AES_TWR_TWEAK_Msk & ((value) << AES_TWR_TWEAK_Pos))
#define AES_TWR_Msk                           _U_(0xFFFFFFFF)                                      /**< (AES_TWR) Register Mask  */


/* -------- AES_ALPHAR : (AES Offset: 0xD0) ( /W 32) Alpha Word Register -------- */
#define AES_ALPHAR_ALPHA_Pos                  _U_(0)                                               /**< (AES_ALPHAR) Alpha Word x Position */
#define AES_ALPHAR_ALPHA_Msk                  (_U_(0xFFFFFFFF) << AES_ALPHAR_ALPHA_Pos)            /**< (AES_ALPHAR) Alpha Word x Mask */
#define AES_ALPHAR_ALPHA(value)               (AES_ALPHAR_ALPHA_Msk & ((value) << AES_ALPHAR_ALPHA_Pos))
#define AES_ALPHAR_Msk                        _U_(0xFFFFFFFF)                                      /**< (AES_ALPHAR) Register Mask  */


/* -------- AES_WPMR : (AES Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define AES_WPMR_WPEN_Pos                     _U_(0)                                               /**< (AES_WPMR) Write Protection Configuration Enable Position */
#define AES_WPMR_WPEN_Msk                     (_U_(0x1) << AES_WPMR_WPEN_Pos)                      /**< (AES_WPMR) Write Protection Configuration Enable Mask */
#define AES_WPMR_WPEN(value)                  (AES_WPMR_WPEN_Msk & ((value) << AES_WPMR_WPEN_Pos))
#define AES_WPMR_WPITEN_Pos                   _U_(1)                                               /**< (AES_WPMR) Write Protection Interruption Enable Position */
#define AES_WPMR_WPITEN_Msk                   (_U_(0x1) << AES_WPMR_WPITEN_Pos)                    /**< (AES_WPMR) Write Protection Interruption Enable Mask */
#define AES_WPMR_WPITEN(value)                (AES_WPMR_WPITEN_Msk & ((value) << AES_WPMR_WPITEN_Pos))
#define AES_WPMR_WPCREN_Pos                   _U_(2)                                               /**< (AES_WPMR) Write Protection Control Enable Position */
#define AES_WPMR_WPCREN_Msk                   (_U_(0x1) << AES_WPMR_WPCREN_Pos)                    /**< (AES_WPMR) Write Protection Control Enable Mask */
#define AES_WPMR_WPCREN(value)                (AES_WPMR_WPCREN_Msk & ((value) << AES_WPMR_WPCREN_Pos))
#define AES_WPMR_FIRSTE_Pos                   _U_(4)                                               /**< (AES_WPMR) First Error Report Enable Position */
#define AES_WPMR_FIRSTE_Msk                   (_U_(0x1) << AES_WPMR_FIRSTE_Pos)                    /**< (AES_WPMR) First Error Report Enable Mask */
#define AES_WPMR_FIRSTE(value)                (AES_WPMR_FIRSTE_Msk & ((value) << AES_WPMR_FIRSTE_Pos))
#define AES_WPMR_ACTION_Pos                   _U_(5)                                               /**< (AES_WPMR) Action on Abnormal Event Detection Position */
#define AES_WPMR_ACTION_Msk                   (_U_(0x7) << AES_WPMR_ACTION_Pos)                    /**< (AES_WPMR) Action on Abnormal Event Detection Mask */
#define AES_WPMR_ACTION(value)                (AES_WPMR_ACTION_Msk & ((value) << AES_WPMR_ACTION_Pos))
#define   AES_WPMR_ACTION_REPORT_ONLY_Val     _U_(0x0)                                             /**< (AES_WPMR) No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags is set.  */
#define   AES_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE_Val _U_(0x1)                                             /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.  */
#define   AES_WPMR_ACTION_LOCK_CGD_SEQE_Val   _U_(0x2)                                             /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.  */
#define   AES_WPMR_ACTION_LOCK_ANY_EV_Val     _U_(0x3)                                             /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.  */
#define   AES_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE_Val _U_(0x4)                                             /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.Moreover, the AES_KEYWRx key is immedialely cleared.  */
#define   AES_WPMR_ACTION_CLEAR_CGD_SEQE_Val  _U_(0x5)                                             /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.Moreover, the AES_KEYWRx key is immedialely cleared.  */
#define   AES_WPMR_ACTION_CLEAR_ANY_EV_Val    _U_(0x6)                                             /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.Moreover, the AES_KEYWRx key is immedialely cleared.  */
#define AES_WPMR_ACTION_REPORT_ONLY           (AES_WPMR_ACTION_REPORT_ONLY_Val << AES_WPMR_ACTION_Pos) /**< (AES_WPMR) No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags is set. Position  */
#define AES_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE  (AES_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE_Val << AES_WPMR_ACTION_Pos) /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued. Position  */
#define AES_WPMR_ACTION_LOCK_CGD_SEQE         (AES_WPMR_ACTION_LOCK_CGD_SEQE_Val << AES_WPMR_ACTION_Pos) /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued. Position  */
#define AES_WPMR_ACTION_LOCK_ANY_EV           (AES_WPMR_ACTION_LOCK_ANY_EV_Val << AES_WPMR_ACTION_Pos) /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued. Position  */
#define AES_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE (AES_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE_Val << AES_WPMR_ACTION_Pos) /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.Moreover, the AES_KEYWRx key is immedialely cleared. Position  */
#define AES_WPMR_ACTION_CLEAR_CGD_SEQE        (AES_WPMR_ACTION_CLEAR_CGD_SEQE_Val << AES_WPMR_ACTION_Pos) /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.Moreover, the AES_KEYWRx key is immedialely cleared. Position  */
#define AES_WPMR_ACTION_CLEAR_ANY_EV          (AES_WPMR_ACTION_CLEAR_ANY_EV_Val << AES_WPMR_ACTION_Pos) /**< (AES_WPMR) If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued.Moreover, the AES_KEYWRx key is immedialely cleared. Position  */
#define AES_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (AES_WPMR) Write Protection Key Position */
#define AES_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << AES_WPMR_WPKEY_Pos)                /**< (AES_WPMR) Write Protection Key Mask */
#define AES_WPMR_WPKEY(value)                 (AES_WPMR_WPKEY_Msk & ((value) << AES_WPMR_WPKEY_Pos))
#define   AES_WPMR_WPKEY_PASSWD_Val           _U_(0x414553)                                        /**< (AES_WPMR) Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits.Always reads as 0.  */
#define AES_WPMR_WPKEY_PASSWD                 (AES_WPMR_WPKEY_PASSWD_Val << AES_WPMR_WPKEY_Pos)    /**< (AES_WPMR) Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits.Always reads as 0. Position  */
#define AES_WPMR_Msk                          _U_(0xFFFFFFF7)                                      /**< (AES_WPMR) Register Mask  */


/* -------- AES_WPSR : (AES Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define AES_WPSR_WPVS_Pos                     _U_(0)                                               /**< (AES_WPSR) Write Protection Violation Status (cleared on read) Position */
#define AES_WPSR_WPVS_Msk                     (_U_(0x1) << AES_WPSR_WPVS_Pos)                      /**< (AES_WPSR) Write Protection Violation Status (cleared on read) Mask */
#define AES_WPSR_WPVS(value)                  (AES_WPSR_WPVS_Msk & ((value) << AES_WPSR_WPVS_Pos))
#define AES_WPSR_CGD_Pos                      _U_(1)                                               /**< (AES_WPSR) Clock Glitch Detected (cleared on read) Position */
#define AES_WPSR_CGD_Msk                      (_U_(0x1) << AES_WPSR_CGD_Pos)                       /**< (AES_WPSR) Clock Glitch Detected (cleared on read) Mask */
#define AES_WPSR_CGD(value)                   (AES_WPSR_CGD_Msk & ((value) << AES_WPSR_CGD_Pos))  
#define AES_WPSR_SEQE_Pos                     _U_(2)                                               /**< (AES_WPSR) Internal Sequencer Error (cleared on read) Position */
#define AES_WPSR_SEQE_Msk                     (_U_(0x1) << AES_WPSR_SEQE_Pos)                      /**< (AES_WPSR) Internal Sequencer Error (cleared on read) Mask */
#define AES_WPSR_SEQE(value)                  (AES_WPSR_SEQE_Msk & ((value) << AES_WPSR_SEQE_Pos))
#define AES_WPSR_SWE_Pos                      _U_(3)                                               /**< (AES_WPSR) Software Control Error (cleared on read) Position */
#define AES_WPSR_SWE_Msk                      (_U_(0x1) << AES_WPSR_SWE_Pos)                       /**< (AES_WPSR) Software Control Error (cleared on read) Mask */
#define AES_WPSR_SWE(value)                   (AES_WPSR_SWE_Msk & ((value) << AES_WPSR_SWE_Pos))  
#define AES_WPSR_PKRPVS_Pos                   _U_(4)                                               /**< (AES_WPSR) Private Key Internal Register Protection Violation Status (cleared on read) Position */
#define AES_WPSR_PKRPVS_Msk                   (_U_(0x1) << AES_WPSR_PKRPVS_Pos)                    /**< (AES_WPSR) Private Key Internal Register Protection Violation Status (cleared on read) Mask */
#define AES_WPSR_PKRPVS(value)                (AES_WPSR_PKRPVS_Msk & ((value) << AES_WPSR_PKRPVS_Pos))
#define AES_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (AES_WPSR) Write Protection Violation Source Position */
#define AES_WPSR_WPVSRC_Msk                   (_U_(0xFF) << AES_WPSR_WPVSRC_Pos)                   /**< (AES_WPSR) Write Protection Violation Source Mask */
#define AES_WPSR_WPVSRC(value)                (AES_WPSR_WPVSRC_Msk & ((value) << AES_WPSR_WPVSRC_Pos))
#define AES_WPSR_SWETYP_Pos                   _U_(24)                                              /**< (AES_WPSR) Software Error Type (cleared on read) Position */
#define AES_WPSR_SWETYP_Msk                   (_U_(0xF) << AES_WPSR_SWETYP_Pos)                    /**< (AES_WPSR) Software Error Type (cleared on read) Mask */
#define AES_WPSR_SWETYP(value)                (AES_WPSR_SWETYP_Msk & ((value) << AES_WPSR_SWETYP_Pos))
#define   AES_WPSR_SWETYP_READ_WO_Val         _U_(0x0)                                             /**< (AES_WPSR) A write-only register has been read (Warning).  */
#define   AES_WPSR_SWETYP_WRITE_RO_Val        _U_(0x1)                                             /**< (AES_WPSR) AES is enabled and a write access has been performed on a read-only register (Warning).  */
#define   AES_WPSR_SWETYP_UNDEF_RW_Val        _U_(0x2)                                             /**< (AES_WPSR) Access to an undefined address (Warning).  */
#define   AES_WPSR_SWETYP_CTRL_START_Val      _U_(0x3)                                             /**< (AES_WPSR) Abnormal use of AES_CR.START command when DMA access is configured.  */
#define   AES_WPSR_SWETYP_WEIRD_ACTION_Val    _U_(0x4)                                             /**< (AES_WPSR) A key write, init value write, output data read, AES_MR and AES_EMR write, GCM configuration registers write, AES_TWRx and AES_ALPHARx registers write, AES_BCNT write, private key bus access has been performed while a current processing is in progress (abnormal).  */
#define   AES_WPSR_SWETYP_INCOMPLETE_KEY_Val  _U_(0x5)                                             /**< (AES_WPSR) A tentative of start is required while the key is not fully loaded into the AES_KEYWRx registers.  */
#define AES_WPSR_SWETYP_READ_WO               (AES_WPSR_SWETYP_READ_WO_Val << AES_WPSR_SWETYP_Pos) /**< (AES_WPSR) A write-only register has been read (Warning). Position  */
#define AES_WPSR_SWETYP_WRITE_RO              (AES_WPSR_SWETYP_WRITE_RO_Val << AES_WPSR_SWETYP_Pos) /**< (AES_WPSR) AES is enabled and a write access has been performed on a read-only register (Warning). Position  */
#define AES_WPSR_SWETYP_UNDEF_RW              (AES_WPSR_SWETYP_UNDEF_RW_Val << AES_WPSR_SWETYP_Pos) /**< (AES_WPSR) Access to an undefined address (Warning). Position  */
#define AES_WPSR_SWETYP_CTRL_START            (AES_WPSR_SWETYP_CTRL_START_Val << AES_WPSR_SWETYP_Pos) /**< (AES_WPSR) Abnormal use of AES_CR.START command when DMA access is configured. Position  */
#define AES_WPSR_SWETYP_WEIRD_ACTION          (AES_WPSR_SWETYP_WEIRD_ACTION_Val << AES_WPSR_SWETYP_Pos) /**< (AES_WPSR) A key write, init value write, output data read, AES_MR and AES_EMR write, GCM configuration registers write, AES_TWRx and AES_ALPHARx registers write, AES_BCNT write, private key bus access has been performed while a current processing is in progress (abnormal). Position  */
#define AES_WPSR_SWETYP_INCOMPLETE_KEY        (AES_WPSR_SWETYP_INCOMPLETE_KEY_Val << AES_WPSR_SWETYP_Pos) /**< (AES_WPSR) A tentative of start is required while the key is not fully loaded into the AES_KEYWRx registers. Position  */
#define AES_WPSR_ECLASS_Pos                   _U_(31)                                              /**< (AES_WPSR) Software Error Class (cleared on read) Position */
#define AES_WPSR_ECLASS_Msk                   (_U_(0x1) << AES_WPSR_ECLASS_Pos)                    /**< (AES_WPSR) Software Error Class (cleared on read) Mask */
#define AES_WPSR_ECLASS(value)                (AES_WPSR_ECLASS_Msk & ((value) << AES_WPSR_ECLASS_Pos))
#define   AES_WPSR_ECLASS_WARNING_Val         _U_(0x0)                                             /**< (AES_WPSR) An abnormal access that does not affect system functionality  */
#define   AES_WPSR_ECLASS_ERROR_Val           _U_(0x1)                                             /**< (AES_WPSR) An access is performed into key, input data, control registers while the AES is performing an encryp-tion/decryption or a start is request by software or DMA while the key is not fully configured.  */
#define AES_WPSR_ECLASS_WARNING               (AES_WPSR_ECLASS_WARNING_Val << AES_WPSR_ECLASS_Pos) /**< (AES_WPSR) An abnormal access that does not affect system functionality Position  */
#define AES_WPSR_ECLASS_ERROR                 (AES_WPSR_ECLASS_ERROR_Val << AES_WPSR_ECLASS_Pos)   /**< (AES_WPSR) An access is performed into key, input data, control registers while the AES is performing an encryp-tion/decryption or a start is request by software or DMA while the key is not fully configured. Position  */
#define AES_WPSR_Msk                          _U_(0x8F00FF1F)                                      /**< (AES_WPSR) Register Mask  */


/* -------- AES_VERSION : (AES Offset: 0xFC) ( R/ 32) Version Register -------- */
#define AES_VERSION_VERSION_Pos               _U_(0)                                               /**< (AES_VERSION) Version of the Hardware Module Position */
#define AES_VERSION_VERSION_Msk               (_U_(0xFFF) << AES_VERSION_VERSION_Pos)              /**< (AES_VERSION) Version of the Hardware Module Mask */
#define AES_VERSION_VERSION(value)            (AES_VERSION_VERSION_Msk & ((value) << AES_VERSION_VERSION_Pos))
#define AES_VERSION_MFN_Pos                   _U_(16)                                              /**< (AES_VERSION) Metal Fix Number Position */
#define AES_VERSION_MFN_Msk                   (_U_(0x7) << AES_VERSION_MFN_Pos)                    /**< (AES_VERSION) Metal Fix Number Mask */
#define AES_VERSION_MFN(value)                (AES_VERSION_MFN_Msk & ((value) << AES_VERSION_MFN_Pos))
#define AES_VERSION_Msk                       _U_(0x00070FFF)                                      /**< (AES_VERSION) Register Mask  */


/** \brief AES register offsets definitions */
#define AES_CR_REG_OFST                (0x00)              /**< (AES_CR) Control Register Offset */
#define AES_MR_REG_OFST                (0x04)              /**< (AES_MR) Mode Register Offset */
#define AES_IER_REG_OFST               (0x10)              /**< (AES_IER) Interrupt Enable Register Offset */
#define AES_IDR_REG_OFST               (0x14)              /**< (AES_IDR) Interrupt Disable Register Offset */
#define AES_IMR_REG_OFST               (0x18)              /**< (AES_IMR) Interrupt Mask Register Offset */
#define AES_ISR_REG_OFST               (0x1C)              /**< (AES_ISR) Interrupt Status Register Offset */
#define AES_KEYWR_REG_OFST             (0x20)              /**< (AES_KEYWR) Key Word Register Offset */
#define AES_IDATAR_REG_OFST            (0x40)              /**< (AES_IDATAR) Input Data Register Offset */
#define AES_ODATAR_REG_OFST            (0x50)              /**< (AES_ODATAR) Output Data Register Offset */
#define AES_IVR_REG_OFST               (0x60)              /**< (AES_IVR) Initialization Vector Register Offset */
#define AES_AADLENR_REG_OFST           (0x70)              /**< (AES_AADLENR) Additional Authenticated Data Length Register Offset */
#define AES_CLENR_REG_OFST             (0x74)              /**< (AES_CLENR) Plaintext/Ciphertext Length Register Offset */
#define AES_GHASHR_REG_OFST            (0x78)              /**< (AES_GHASHR) GCM Intermediate Hash Word Register Offset */
#define AES_TAGR_REG_OFST              (0x88)              /**< (AES_TAGR) GCM Authentication Tag Word Register Offset */
#define AES_CTRR_REG_OFST              (0x98)              /**< (AES_CTRR) GCM Encryption Counter Value Register Offset */
#define AES_GCMHR_REG_OFST             (0x9C)              /**< (AES_GCMHR) GCM H Word Register Offset */
#define AES_EMR_REG_OFST               (0xB0)              /**< (AES_EMR) Extended Mode Register Offset */
#define AES_BCNT_REG_OFST              (0xB4)              /**< (AES_BCNT) Byte Counter Register Offset */
#define AES_TWR_REG_OFST               (0xC0)              /**< (AES_TWR) Tweak Word Register Offset */
#define AES_ALPHAR_REG_OFST            (0xD0)              /**< (AES_ALPHAR) Alpha Word Register Offset */
#define AES_WPMR_REG_OFST              (0xE4)              /**< (AES_WPMR) Write Protection Mode Register Offset */
#define AES_WPSR_REG_OFST              (0xE8)              /**< (AES_WPSR) Write Protection Status Register Offset */
#define AES_VERSION_REG_OFST           (0xFC)              /**< (AES_VERSION) Version Register Offset */

